//&Вместо("СвойстваКоллекцийОбъектовМетаданных")
//Функция Базар_СвойстваКоллекцийОбъектовМетаданных(ОбъектыРасширений = Ложь) Экспорт
//	
//	СвойстваКоллекцийОбъектовМетаданных = ПродолжитьВызов(ОбъектыРасширений);
//	
//	// РегистрыНакопления
//	Строка = СвойстваКоллекцийОбъектовМетаданных.Добавить();
//	Строка.Идентификатор   = Новый УникальныйИдентификатор("74083488-b01e-4441-84a6-c386ce88cdb5");
//	Строка.Имя             = "РегистрыНакопления";
//	Строка.Синоним         = НСтр("ru = 'Регистры накопления'");
//	Строка.ИмяВЕдЧисле     = "РегистрНакопления";
//	Строка.СинонимВЕдЧисле = НСтр("ru = 'Регистр накопления'");
//	Строка.ОбъектыРасширений = Истина;
//	
//	Возврат СвойстваКоллекцийОбъектовМетаданных;
//	
//КонецФункции