
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Контрагент") тогда
		Элементы.Контрагент.Видимость = Ложь;
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.Контрагент;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Номенклатура") тогда
		Элементы.Номенклатура.Видимость = Ложь;
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.Номенклатура;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
