//Функция формирует список времени "По полчаса" для загрузки в элемент управления
Функция СписокВремениНачалаЛогистики(ВремяЛогистикиНачало = Неопределено,ВремяЛогистикиОкончание = Неопределено) Экспорт
	СписокВремени = Новый СписокЗначений;
	Для Часы = 0 по 23 цикл 
		Для Минуты = 0 по 1 Цикл
			Время = Дата(1,1,1, Часы, Минуты * 30, 0);
			
			Если ЗначениеЗаполнено(ВремяЛогистикиНачало) и Время <= ВремяЛогистикиНачало тогда 
				Продолжить; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВремяЛогистикиОкончание) и Время >= ВремяЛогистикиОкончание тогда 
				Прервать; 
			КонецЕсли; 
			
			Если Время <> Дата("00010101") Тогда 
				СписокВремени.Добавить(Время, Формат(Время,"ДФ=ЧЧ:мм")); 
			Иначе 
				СписокВремени.Добавить(Дата("00010101000001"), "00:00") 
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
	Возврат СписокВремени;
КонецФункции

Процедура ОткрытьФормуДокументДоставка(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если НЕ Форма.ТолькоПросмотр Тогда
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТолькоПросмотр,
	                                 |Ссылка,
	                                 |Дата,
	                                 |Организация,
	                                 |Грузоотправитель,
	                                 |Контрагент,
	                                 |ДоговорКонтрагента,
	                                 |Грузополучатель,
	                                 |АдресДоставки,
	                                 |АдресДоставкиJSON,
	                                 |Дата,
	                                 |ПеревозкаАвтотранспортом,
	                                 |Перевозчик,
	                                 |АвтомобильСсылка,
	                                 |МаркаАвтомобиля,
	                                 |РегистрационныйЗнакАвтомобиля,
	                                 |ВодительСсылка,
	                                 |Водитель,
	                                 |Маршрут,
	                                 |ВодительскоеУдостоверение,
	                                 |КраткоеНаименованиеГруза,
	                                 |СопроводительныеДокументы,
	                                 |СведенияОТранспортировкеИГрузе,
	                                 |РазделПеревозкаАвтотранспортом,
	                                 |ВремяЛогистикиНачало,
	                                 |ВремяЛогистикиОкончание");
		
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		ПараметрыФормы.РазделПеревозкаАвтотранспортом = Истина;
	Иначе
		ПараметрыФормы.РазделПеревозкаАвтотранспортом = Ложь;
	КонецЕсли;

	ПараметрыФормы.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	ОткрытьФорму("ОбщаяФорма.ДокументДоставка", ПараметрыФормы, Форма);
	
КонецПроцедуры

Функция СформироватьНадписьДоставкаВДокументе(Форма, ВодительАвтомобиль = Ложь) Экспорт
	
	Объект = Форма.Объект;
	ЭлементНадпись = Форма.Элементы.ДекорацияДоставка;
	
	БезПеревозки = НЕ Объект.ПеревозкаАвтотранспортом;
	
	Если НЕ БезПеревозки тогда
		
		ТекстНадписи = "";
		
		Если ЗначениеЗаполнено(Объект.АдресДоставки) тогда
			ТекстНадписи = СокрЛП(Объект.АдресДоставки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстНадписи) тогда
			
			Если ЗначениеЗаполнено(Объект.ВремяЛогистикиНачало)
				И ЗначениеЗаполнено(Объект.ВремяЛогистикиОкончание) тогда
				
				ТекстНадписи = ТекстНадписи +
					" (с " +
					Формат(Объект.ВремяЛогистикиНачало,"ДФ=HH:mm") +
					" по " +
					Формат(Объект.ВремяЛогистикиОкончание,"ДФ=HH:mm") +
					")";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстНадписи) тогда
			
			Если ЗначениеЗаполнено(Объект.Грузополучатель) И Объект.Грузополучатель <> Объект.Контрагент тогда
				ТекстНадписи = Строка(Объект.Грузополучатель) +
					": " +
					ТекстНадписи;
				КонецЕсли;
				
		КонецЕсли;
		
		Если ВодительАвтомобиль И ТранспортнаяЛогистикаСервер.ДокументУчаствуетВТранспортнойЛогистике(Объект.Ссылка) тогда
			
			ТекстВодительАвтомобиль = "Водитель: " +
				Объект.ВодительСсылка +
				"; Автомобиль: " +
				Объект.АвтомобильСсылка;
			
			ТекстНадписи = ТекстНадписи +
				Символы.ПС +
				ТекстВодительАвтомобиль;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстНадписи) ИЛИ БезПеревозки тогда
		ЭлементНадпись.Заголовок = "Без перевозки автотранспортом";
	Иначе
		ЭлементНадпись.Заголовок = ТекстНадписи;
	КонецЕсли;
	
КонецФункции