
&НаСервере
Процедура Базар_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачалоДействия") Тогда
		Сообщить("НачалоДействия = " + Параметры.НачалоДействия);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "НачалоДействия",
		                                                        Параметры.НачалоДействия,
		                                                        ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	КонецЕсли;
	
	Если Параметры.Свойство("СрокДействия") Тогда
		Сообщить("СрокДействия = " + Параметры.СрокДействия);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "СрокДействия",
		                                                        Параметры.СрокДействия,
		                                                        ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	КонецЕсли;
	
КонецПроцедуры
