Функция Базар_ВремяДокументаПоУмолчанию(Источник) Экспорт
	
	//Если ЕстьДокументыДляЗачетаАванса(Источник) тогда
		Возврат Новый Структура("Часы, Минуты", 15, 30);
	//Иначе
	//	Возврат Новый Структура("Часы, Минуты", 3, 0);
	//КонецЕсли;
	
КонецФункции

//Функция ЕстьДокументыДляЗачетаАванса(Источник)
//	
//	Если НЕ Источник.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя") тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	ВидыСубконто = Новый Массив;
//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Организация"       , Источник.Организация);
//	Запрос.УстановитьПараметр("Контрагент"        , Источник.ДоговорКонтрагента.Владелец);
//	Запрос.УстановитьПараметр("ДоговорКонтрагента", Источник.ДоговорКонтрагента);
//	Запрос.УстановитьПараметр("Дата"              , Источник.Дата);
//	Запрос.УстановитьПараметр("Счет"              , ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетыСПокупателями"));
//	Запрос.УстановитьПараметр("ВидыСубконто"      , ВидыСубконто);
//	Запрос.УстановитьПараметр("ТипРеализация"     , Тип("ДокументСсылка.РеализацияТоваровУслуг"));
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор
//	|ИЗ
//	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
//	|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
//	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
//	|			Регистратор,
//	|			Движения,
//	|			Счет = &Счет,
//	|			&ВидыСубконто,
//	|			Организация = &Организация
//	|				И Субконто1 = &Контрагент
//	|				И Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстаткиИОбороты
//	|ГДЕ
//	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт > 0
//	|	И ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Регистратор) = &ТипРеализация
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ХозрасчетныйОстаткиИОбороты.Регистратор";
//	
//	Выборка = Запрос.Выполнить().Выбрать();	
//	
//	Возврат Выборка.Следующий();
//	
//КонецФункции