&НаКлиенте
&Вместо("ЮрАдресКонтрагентаНажатие")
Процедура Базар_ЮрАдресКонтрагентаНажатие(Элемент, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Страна", Объект.СтранаРегистрации);
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
&Вместо("ФактАдресКонтрагентаНажатие")
Процедура Базар_ФактАдресКонтрагентаНажатие(Элемент, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПочтовыйАдресКонтрагентаНачалоВыбора")
Процедура Базар_ПочтовыйАдресКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Страна", Объект.СтранаРегистрации);
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка, ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура Базар_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ДобавлениеИзменениеКонтактнойИнформацииКонтрагентов") тогда
		
		РодительскиеГруппы = Новый Массив;
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформация");
		РодительскиеГруппы.Добавить("ГруппаАдреса");
		РодительскиеГруппы.Добавить("ГруппаКомпоновкиКонтактнойИнформации");
		РодительскиеГруппы.Добавить("ГруппаЮридическийАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаФактАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаПочтовыйАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаЮрАдресДопДействия");
		РодительскиеГруппы.Добавить("ГруппаФактическийАдрес");
		РодительскиеГруппы.Добавить("ГруппаПочтовыйАдрес");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеТелефонКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеФаксКонтрагенты");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеEmailКонтрагенты");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеДругаяИнформацияКонтрагенты");
		
		Для Каждого Элемент из Элементы цикл
			
			Если НЕ ТипЗнч(Элемент.Родитель) = Тип("ГруппаФормы") тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ РодительскиеГруппы.Найти(Элемент.Родитель.Имя) = Неопределено ТОгда
				Если ТипЗнч(Элемент) = Тип("КнопкаФормы") тогда
					Элемент.Доступность = Истина;
				ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеФормы") тогда
					Элемент.ТолькоПросмотр = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
