// Устанавливает статус нескольких документов.
// Статус может быть измененен только у тех документов, на редактирование которых у пользователя есть права.
//
// Параметры:
//  МассивДокументов     - Массив - содержит ссылки на документы (должны быть одного вида!)
//  СтатусыДокумента     - Структура - см. НовыеСтатусыДокумента()
//
// Возвращаемое значение:
//  Булево - Истина, если статус хотя бы одного документа изменен
//
&Вместо("УстановитьСтатусыДокументов")
Функция Базар_УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтатусыДокумента) тогда
		Возврат Ложь;
	Иначе
		Возврат ПродолжитьВызов(МассивДокументов, СтатусыДокумента);
	КонецЕсли;
	
КонецФункции