&НаКлиенте
Процедура ВыбратьВыделеные(Команда)
	
	ОповеститьОВыборе(ПодготовитьВыбранныеЗначения(Элементы.Список.ТекущиеДанные.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(ПодготовитьВыбранныеЗначения(Элементы.Список.ТекущиеДанные.Ссылка));
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьВыбранныеЗначения(ТекущаяСсылка)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 ИЛИ НЕ МножественныйВыбор тогда
		
		Возврат ТекущаяСсылка;
		
	Иначе
		
		МассивВыбранных = Новый Массив;
		
		Для Каждого СтрокаСписка из Элементы.Список.ВыделенныеСтроки цикл
			МассивВыбранных.Добавить(СтрокаСписка.Ссылка);
		КонецЦикла;
		
		Возврат МассивВыбранных;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МножественныйВыбор") тогда
		МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	Для Каждого ВидСтавки Из Перечисления.ВидыСтавокНДС Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВидСтавкиНДС");

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Список.ВидСтавкиНДС", ВидСравненияКомпоновкиДанных.Равно, ВидСтавки);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",
			Строка(Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавки, ТекущаяДатаПользователя)));
		
	КонецЦикла;
	
КонецПроцедуры