&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

&НаСервереБезКонтекста
Процедура СменитьСтатусБумажногоДокументаНаСервере(Документ, СтатусБумажногоДокумента)
	
	НаборЗаписей = РегистрыСведений.Базар_СтатусыНаличияБумажногоДокумента.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Документ);
	НаборЗаписей.Очистить();
	
	НоваяЗапись                          = НаборЗаписей.Добавить();
	НоваяЗапись.Объект                   = Документ;
	НоваяЗапись.СтатусБумажногоДокумента = СтатусБумажногоДокумента;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусБумажногоДокумента(Команда)
	СсылкаНаДокумент = ПолучитьЗначениеРеквизита(Элементы.Список.ВыделенныеСтроки[0], "Ссылка");
	
	Если Команда.Имя = "СменитьСтатусБумажногоДокумента_Отсутствует" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.Отсутствует");
	ИначеЕсли Команда.Имя = "СменитьСтатусБумажногоДокумента_СОшибками" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученСОшибками");
	ИначеЕсли Команда.Имя = "СменитьСтатусБумажногоДокумента_Корректный" тогда
		СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученКорректным");
	КонецЕсли;
	
	Для Счетчик = 1 по Элементы.Список.ВыделенныеСтроки.Количество() цикл
		СтрокаСписка = Элементы.Список.ВыделенныеСтроки.Получить(Счетчик - 1);
		СсылкаНаОбъект = ПолучитьЗначениеРеквизита(СтрокаСписка, "Ссылка");
		Если ПолучитьЗначениеРеквизита(СсылкаНаОбъект, "Проведен") тогда
			Если УстановитьПометкиСтатусаБумажногоДокумента(СтатусБумажногоДокумента) тогда
				СменитьСтатусБумажногоДокументаНаСервере(СсылкаНаОбъект, СтатусБумажногоДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Функция УстановитьПометкиСтатусаБумажногоДокумента(СтатусБумажногоДокумента = Неопределено)
	
	ДоступностьЭлементовУправления = Истина;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(СтатусБумажногоДокумента) тогда
			СтатусБумажногоДокумента = Элементы.Список.ТекущиеДанные.СтатусБумажногоДокумента;
		КонецЕсли;
		
		Если НЕ ПолучитьЗначениеРеквизита(Элементы.Список.ВыделенныеСтроки[0], "Проведен") тогда
			ДоступностьЭлементовУправления = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.Отсутствует") тогда
			Элементы.Отсутствует.Пометка = Истина;
			Элементы.Отсутствует1.Пометка = Истина;
		Иначе
			Элементы.Отсутствует.Пометка = Ложь;
			Элементы.Отсутствует1.Пометка = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученСОшибками") тогда
			Элементы.СОшибками.Пометка = Истина;
			Элементы.СОшибками1.Пометка = Истина;
		Иначе
			Элементы.СОшибками.Пометка = Ложь;
			Элементы.СОшибками1.Пометка = Ложь;
		КонецЕсли;
		
		Если СтатусБумажногоДокумента = ПредопределенноеЗначение("Перечисление.Базар_СтатусыНаличияБумажногоДокумента.ПолученКорректным") тогда
			Элементы.Корректный.Пометка = Истина;
			Элементы.Корректный1.Пометка = Истина;
		Иначе
			Элементы.Корректный.Пометка = Ложь;
			Элементы.Корректный1.Пометка = Ложь;
		КонецЕсли;
		
	Исключение
		ДоступностьЭлементовУправления = Ложь;
	КонецПопытки;
	
	Если Элементы.Отсутствует.Доступность <> ДоступностьЭлементовУправления тогда
		Элементы.Отсутствует.Доступность  = ДоступностьЭлементовУправления;
		Элементы.Отсутствует1.Доступность = ДоступностьЭлементовУправления;
		Элементы.СОшибками.Доступность    = ДоступностьЭлементовУправления;
		Элементы.СОшибками1.Доступность   = ДоступностьЭлементовУправления;
		Элементы.Корректный.Доступность   = ДоступностьЭлементовУправления;
		Элементы.Корректный1.Доступность  = ДоступностьЭлементовУправления;
	КонецЕсли;
	
	Возврат ДоступностьЭлементовУправления;
КонецФункции

&НаКлиенте
Процедура Базар_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	УстановитьПометкиСтатусаБумажногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_СписокПриИзмененииПосле(Элемент)
	
	УстановитьПометкиСтатусаБумажногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ПриОткрытииПосле(Отказ)
	
	ОтображатьСтатусыДокументов = Ложь;
	Элементы.ИзменитьСтатус.Видимость = Ложь;
	Элементы.ПодменюСтатус.Видимость = Ложь;
	Элементы.СписокКонтекстноеМенюПодменюСтатус.Видимость = Ложь;
	
КонецПроцедуры
