Функция ПредопределенноеЗначениеРасширения(ТипОбъекта, ИмяОбъекта, Код) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ТипОбъекта)
	 ИЛИ НЕ ЗначениеЗаполнено(ИмяОбъекта) 
	 ИЛИ НЕ ЗначениеЗаполнено(Код) тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ТипОбъекта + "." + ИмяОбъекта);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторМетаданных) тогда
		ИдентификаторМетаданных = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоРеквизиту("ПолноеИмя", ТипОбъекта + "." + ИмяОбъекта);
		Если НЕ ЗначениеЗаполнено(ИдентификаторМетаданных) тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ПредопределенныеЭлементыРасширения.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.Базар_ПредопределенныеЭлементыРасширения КАК ПредопределенныеЭлементыРасширения
	               |ГДЕ
	               |	ПредопределенныеЭлементыРасширения.Код = &Код
	               |	И ПредопределенныеЭлементыРасширения.ОбъектМетаданных = &ИдентификаторМетаданных
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредопределенныеЭлементыРасширения.Ссылка";
	
	Запрос.УстановитьПараметр("ИдентификаторМетаданных", ИдентификаторМетаданных);
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		ПредопределенныйРеквизит = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПредопределенныйРеквизит;
	
КонецФункции