&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверкаНаличияДубликата(Отказ);
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаличияДубликата(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Водители.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Водители КАК Водители
	               |ГДЕ
	               |	Водители.ФизическоеЛицо = &ФизЛицо
	               |	И Водители.Перевозчик = &Перевозчик
	               |	И Водители.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ФизЛицо", Объект.ФизическоеЛицо);
	Запрос.УстановитьПараметр("Перевозчик", Объект.Перевозчик);
	
	Если НЕ Запрос.Выполнить().Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю("Водитель """+Объект.ФизическоеЛицо+""", работающий на организацию "+Объект.Перевозчик + ", уже существует в базе данных!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Строка(Объект.ФизическоеЛицо));
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляФормы(Элемент)
	СформироватьНаименование();
КонецПроцедуры
