
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОтчета",    "ВедомостьПоПросроченнымЗадолженностям");
	ПараметрыОткрытия.Вставить("КлючВарианта", "ВедомостьПоПросроченнымЗадолженностям");
	ПараметрыОткрытия.Вставить("РежимОтчета",  "КредиторскаяЗадолженность");
	
	Уникальность = "Отчет." + ПараметрыОткрытия.ИмяОтчета + "/КлючВарианта." + ПараметрыОткрытия.КлючВарианта;
	
	ПараметрыОткрытия.Вставить("КлючПараметровПечати",        Уникальность);
	ПараметрыОткрытия.Вставить("КлючСохраненияПоложенияОкна", Уникальность);
	
	ОткрытьФорму("Отчет." + ПараметрыОткрытия.ИмяОтчета + ".Форма", ПараметрыОткрытия, Неопределено, Истина);
	
КонецПроцедуры
