
&НаСервере
Процедура Базар_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = "Базар_СхемаКомпоновкиДанных";
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ПриОткрытииПосле(Отказ)
	
	СхемаКомпоновкиДанных = "Базар_СхемаКомпоновкиДанных";
	
КонецПроцедуры

&Вместо("ИнициализироватьКомпоновщикаНастроек")
Процедура Базар_ИнициализироватьКомпоновщикаНастроек()
	
	//БухгалтерскиеОтчетыВызовСервера.ИнициализацияКомпоновщикаНастроек(ЭтотОбъект, Истина, КлючТекущегоВарианта);
	
	КомпоновщикИнициализирован = Истина;
	
	Элементы.НастройкиОтчета.Видимость = Истина;
	
	ИмяОтчета = БухгалтерскиеОтчеты.ИмяОтчета(ЭтаФорма);
	
	Схема = Отчеты[ИмяОтчета].ПолучитьМакет("Базар_СхемаКомпоновкиДанных");
	
	ИмяВариантаНастроек = КлючТекущегоВарианта;
	Если ПустаяСтрока(ИмяВариантаНастроек) Тогда
		ИмяВариантаНастроек = ИмяОтчета;
	КонецЕсли;
	
	ВариантНастроек = Схема.ВариантыНастроек.Найти(ИмяВариантаНастроек);
	
	Если ВариантНастроек <> Неопределено Тогда
		Настройки = ВариантНастроек.Настройки;
	Иначе
		Настройки = Схема.НастройкиПоУмолчанию;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	ТекущиеПользовательскиеНастройки = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(ПользовательскиеНастройки) Тогда
		ТекущиеПользовательскиеНастройки = ПолучитьИзВременногоХранилища(ПользовательскиеНастройки);
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекКомпоновщикаНаСервере(ЭтаФорма, ТекущиеПользовательскиеНастройки);
	
	БухгалтерскиеОтчетыКлиентСервер.ОрганизацияПриИзменении(ЭтаФорма, Отчет.Организация);
	
	БухгалтерскиеОтчетыВызовСервера.ОбновитьОписаниеОтборовОтчета(ЭтаФорма);
	
	ЗаполнитьДополнительныеПоляПоУмолчанию();
	
КонецПроцедуры