
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРозничнаяПродажа.Продажа"));
	ПараметрыОткрытия.Вставить("ДокументОснование", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрыОткрытия);
	
	ОткрытьФорму("Документ.РозничнаяПродажа.Форма.ФормаДокументаОбщая",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"ФормаОбъектаДокументаРозничнаяПродажа",
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
