
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ПараметрКоманды);
	ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием"));
	
	ЗначенияЗаполнения = Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием"));
	
	ПараметрыФормы = Новый Структура("Основание, ЗначенияЗаполнения", ПараметрыОткрытия, ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ДвижениеМногооборотнойТары.ФормаОбъекта",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"ФормаОбъектаДокументаДвижениеМногооборотнойТарыПрием",
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
