
&ИзменениеИКонтроль("ЗаполнитьРеквизитыСчетНаОплату")
Процедура Базар_ЗаполнитьРеквизитыСчетНаОплату(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	// Получим список оснований еще раз, так как строки по основаниям для которых нет товаров к отгрузке могли не добавится
	МассивОснований = СписокСчетовНаОплатуПокупателю(Объект);

	Если МассивОснований.Количество() = 1 Тогда
		Объект.СчетНаОплатуПокупателю = МассивОснований[0];

		ЗаполнитьСчетНаОплатуПоСтрокам(Форма, Неопределено);

	Иначе
		Объект.СчетНаОплатуПокупателю =  Неопределено;

		Форма.СчетНаОплатуГиперссылка = 
		СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = '; %1 документ; ; %1 документа; %1 документов; %1 документов'"),
		МассивОснований.Количество());
	КонецЕсли; 

	УказыватьСчетПоСтрокам = МассивОснований.Количество() > 1;

#Вставка
	Если НЕ Форма.Элементы.Найти("ДобавитьИзСчета") = Неопределено Тогда
#КонецВставки
	Элементы.ДобавитьИзСчета.Видимость         = НЕ УказыватьСчетПоСтрокам;
	Элементы.СчетНаОплатуГиперссылка.Видимость = УказыватьСчетПоСтрокам;
	Элементы.СчетНаОплатуПокупателю.Видимость  = НЕ УказыватьСчетПоСтрокам;
#Вставка
	КонецЕсли;
#КонецВставки
	
	УстановитьВидимость(Форма, "ТоварыСчетНаОплатуПокупателю",          УказыватьСчетПоСтрокам);
	УстановитьВидимость(Форма, "ВозвратнаяТараСчетНаОплатуПокупателю",  УказыватьСчетПоСтрокам);
	УстановитьВидимость(Форма, "УслугиСчетНаОплатуПокупателю",          УказыватьСчетПоСтрокам);
	УстановитьВидимость(Форма, "АгентскиеУслугиСчетНаОплатуПокупателю", УказыватьСчетПоСтрокам);
КонецПроцедуры
