
Процедура ПередЗаписью(Отказ)
	
	СписокОшибок = Неопределено;
	
	Наименование = ОбъектМетаданных.Наименование;
	
	ПроверкаУникальностиНастроекПечати(СписокОшибок);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Наименование");
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПроверкаУникальностиНастроекПечати(СписокОшибок)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиАвтоматическойПечатиБазовые.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиАвтоматическойПечатиБазовые КАК НастройкиАвтоматическойПечатиБазовые
	|ГДЕ
	|	НастройкиАвтоматическойПечатиБазовые.Ссылка <> &Ссылка
	|	И НастройкиАвтоматическойПечатиБазовые.ОбъектМетаданных = &ОбъектМетаданных
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиАвтоматическойПечатиБазовые.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		ТекстСообщения = "Для объекта " +
		                 Строка(ОбъектМетаданных) +
						 " уже существуют настройки автоматической печати.";
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
		                                                        "Объект.ОбъектМетаданных",
		                                                        ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры