Процедура ПересчитатьСуммуГосЗакупок(Строка, СуммаВключаетНДС = Ложь, ЗначениеПустогоКоличества = 0, ПрименяютсяСтавки4и2 = Ложь, НалоговыйАгентПоФЗ335 = Ложь) Экспорт

	Строка.Сумма = Строка.ЦенаГосЗакупок * ?(Строка.КоличествоГосЗакупок =0, ЗначениеПустогоКоличества, Строка.КоличествоГосЗакупок);
	
	Если Строка.Свойство("СуммаСкидки") И Строка.Свойство("ПроцентСкидки") Тогда
		Строка.СуммаСкидки = Строка.Сумма * Строка.ПроцентСкидки / 100;
	КонецЕсли;
	
	Если Строка.Свойство("СтавкаНДС") И Строка.Свойство("Всего") Тогда
		ПересчитатьСуммуНДС(Строка, СуммаВключаетНДС, ПрименяютсяСтавки4и2, НалоговыйАгентПоФЗ335);
	КонецЕсли;

КонецПроцедуры