&Вместо("ДоговорКонтрагентаПриИзмененииНаСервере")
Процедура Базар_ДоговорКонтрагентаПриИзмененииНаСервере()
	
	Если Параметры.Ключ.Пустая() Тогда
		СтавкаНДС = Неопределено;
		СуммаНДС = 0;
	Иначе
		СтавкаНДС = РасшифровкаПлатежаСтавкаНДС;
		СуммаНДС = РасшифровкаПлатежаСуммаНДС;
	КонецЕсли;
	
	СтрокаПлатеж = ПоступлениеНаРасчетныйСчетФормыКлиентСервер.РасшифровкаПлатежаТекущиеДанные(ЭтотОбъект);
	ПоступлениеНаРасчетныйСчетФормы.ДоговорКонтрагентаПриИзмененииНаСервере(СтрокаПлатеж, ЭтотОбъект);
	
	ПоступлениеНаРасчетныйСчетФормыКлиентСервер.ЗаполнитьРеквизитыРасшифровкаПлатежа(ЭтотОбъект, Истина, СтрокаПлатеж);
	
	Если НЕ СтавкаНДС = Неопределено тогда
		РасшифровкаПлатежаСтавкаНДС = СтавкаНДС;
		РасшифровкаПлатежаСуммаНДС = СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Базар_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		Для Каждого СтрокаРасшифровкиПлатежа из Объект.РасшифровкаПлатежа цикл
			
			КонтрольРасчетовНаличнымиДеньгамиСервер.КонтрольРасчетовНаличнымиДеньгами(
				Объект,
				СтрокаРасшифровкиПлатежа.ДоговорКонтрагента,
				СтрокаРасшифровкиПлатежа.СуммаПлатежа,
				Отказ
			);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
