Процедура ЗаполнитьНаОснованииПеремещения(ДокументОбъект, ДокументПеремещение) Экспорт
	
	ДокументОбъект.Перемещение = ДокументПеремещение;
	ДокументОбъект.Дата        = ДокументПеремещение.Дата;
	ДокументОбъект.Организация = ДокументПеремещение.Организация;
	ДокументОбъект.Склад       = ДокументПеремещение.СкладПолучатель;
	ДокументОбъект.Комментарий = ДокументПеремещение.Комментарий;
	ДокументОбъект.Товары.Очистить();
	
	СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(ДокументОбъект.Дата);
	ДокументОбъект.ТипЦен   = СистемныеНастройкиБазар.ТипЦенРозницы;
	
	Для Каждого СтрокаТовары из ДокументПеремещение.Товары цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		
		НоваяСтрока.Номенклатура = СтрокаТовары.Номенклатура;
		НоваяСтрока.Количество   = СтрокаТовары.Количество;
		НоваяСтрока.СтавкаНДС    = Перечисления.СтавкиНДС.СтавкаНДС(СтрокаТовары.Номенклатура.ВидСтавкиНДС, ДокументОбъект.Дата);
		
		НоваяСтрока.Цена = Ценообразование.ЦенаНоменклатуры(
			"Розница",
			ДокументОбъект.Дата,
			СтрокаТовары.Номенклатура
		);
		
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(НоваяСтрока, 0);
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументОбъект.СуммаВключаетНДС);
		
	КонецЦикла;
	
КонецПроцедуры