
&После("ОбработкаЗаполнения")
Процедура Базар_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование") тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
			
			Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийРозничнаяПродажа.Продажа тогда
				Возврат;
			КонецЕсли;
			
			ВидОперации = Перечисления.ВидыОперацийРозничнаяПродажа.Продажа;
			
			Документы.РозничнаяПродажа.ЗаполнитьНаОснованииПеремещения(
				ЭтотОбъект,
				ДанныеЗаполнения.ДокументОснование
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
