&Вместо("ЗаписатьДанныеАутентификацииВНастройкиКлиентаЛицензирования")
Процедура Базар_ЗаписатьДанныеАутентификацииВНастройкиКлиентаЛицензирования(Логин, Пароль)
	
	//НастройкиПодключения = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП();
	//
	//УстановитьНастройкиКлиентаЛицензирования(
	//	Логин,
	//	Пароль,
	//	ЗначениеДопПараметра(НастройкиПодключения.ДоменРасположенияСерверовИПП));
	
КонецПроцедуры

&Вместо("ОбновитьЗначениеДополнительногоПараметраКлиентаЛицензирования")
Процедура Базар_ОбновитьЗначениеДополнительногоПараметраКлиентаЛицензирования()
	
	//Попытка
	//	
	//	Если Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
	//		УстановитьПривилегированныйРежим(Истина);
	//		ДоменнаяЗона = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП().ДоменРасположенияСерверовИПП;
	//		НовоеЗначениеДопПараметра = ЗначениеДопПараметра(ДоменнаяЗона);
	//		Если ПолучитьДополнительныйПараметрКлиентаЛицензирования() <> НовоеЗначениеДопПараметра Тогда
	//			УстановитьНастройкиКлиентаЛицензирования(, , НовоеЗначениеДопПараметра);
	//		КонецЕсли;
	//		УстановитьПривилегированныйРежим(Ложь);
	//	КонецЕсли;
	//	
	//Исключение
	//	
	//	ИнтернетПоддержкаПользователей.ЗаписатьОшибкуВЖурналРегистрации(
	//		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//			НСтр("ru = 'Не удалось обновить значение дополнительного параметра в настройках клиента лицензирования.
	//				|%1'"),
	//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	//	
	//КонецПопытки;
	
КонецПроцедуры