
&После("ОбработкаПроведения")
Процедура ТЛ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Движен = Движения.ТранспортнаяЛогистикаЗаказы;
	//Движен.Очистить();
	//
	//Движ = Движен.Добавить();
	//Движ.ВидДвижения = ВидДвиженияНакопления.Приход;
	//Движ.Период = Дата;
	//Движ.Регистратор = Ссылка;
	//Движ.Организация = Организация;
	//
	//Если Не ЗначениеЗаполнено(ТЛ_Грузоотправитель) тогда
	//	Движ.Грузоотправитель = Контрагент;
	//Иначе
	//	Движ.Грузоотправитель = ТЛ_Грузоотправитель;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ТЛ_Грузополучатель) тогда
	//	Движ.Грузополучатель = Организация;
	//Иначе
	//	Движ.Грузополучатель = ТЛ_Грузополучатель;
	//КонецЕсли;
	//
	//Движ.ДокументДвижения = Ссылка;
	//Движ.Вес = Товары.Итог("ТЛ_Вес");
	//Движ.Количество = Товары.Итог("Количество");
	//Движ.Адрес = ТЛ_АдресЗакупки;
	//
	//
	//Движен.Записать();

	
КонецПроцедуры
