
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СформироватьНаименование();
	ПроверкаНаличияДубликата(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаличияДубликата(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Автомобили.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Автомобили КАК Автомобили
	               |ГДЕ
	               |	Автомобили.РегистрационныйЗнак = &РегистрационныйЗнак
	               |	И Автомобили.Перевозчик = &Перевозчик
	               |	И Автомобили.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("РегистрационныйЗнак", Объект.РегистрационныйЗнак);
	Запрос.УстановитьПараметр("Перевозчик", Объект.Перевозчик);
	
	Если НЕ Запрос.Выполнить().Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю("Автомобиль """+Объект.Наименование+""", работающий на организацию "+Объект.Перевозчик + ", уже существует в базе данных!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Марка               = СокрЛП(Строка(Объект.Марка));
	Объект.Модель              = СокрЛП(Строка(Объект.Модель));
	Объект.РегистрационныйЗнак = СокрЛП(Объект.РегистрационныйЗнак);
	
	Объект.Наименование = Объект.Марка + " " + Объект.Модель+ " (" + СтрЗаменить(Объект.РегистрационныйЗнак,"  "," ") + ")"; 
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляФормы(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		СформироватьНаименование();
	КонецЕсли;
	
КонецПроцедуры
