
&НаСервере
Процедура Базар_ЗаполнитьПодписиУполномоченныхЛицПослеНаСервере()
	
	ПодписиУполномоченныхЛиц = ОтветственныеЛицаБП.РеквизитыПодписиУполномоченныхЛиц(Организация,
	                                                                                 ПользователиКлиентСервер.ТекущийПользователь(),
	                                                                                 Неопределено,
	                                                                                 ДатаДокумента);
	
	ПодписиРуководитель = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"));
	ПодписиГлавныйБухгалтер = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер"));
	ПодписиОтветственныйЗаОформление = ПодписиУполномоченныхЛиц.Получить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление"));
	
	Руководитель = ПодписиРуководитель.ФизическоеЛицо;
	ЗаРуководителяНаОсновании = ПодписиРуководитель.ОснованиеПраваПодписи;
	ГлавныйБухгалтер = ПодписиГлавныйБухгалтер.ФизическоеЛицо;
	ЗаГлавногоБухгалтераНаОсновании = ПодписиГлавныйБухгалтер.ОснованиеПраваПодписи;
	ОтветственныйЗаОформление = ПодписиОтветственныйЗаОформление.ФизическоеЛицо;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ЗаполнитьПодписиУполномоченныхЛицПосле(Команда)
	
	Базар_ЗаполнитьПодписиУполномоченныхЛицПослеНаСервере();
	
КонецПроцедуры
