
&НаСервере
Процедура ПриИзмененииЗначенияПоляНаСервере()
	Если Объект.ВидСтандартаНаПродукцию = ПредопределенноеЗначение("Перечисление.Базар_ВидыСтандартовНаПродукцию.Импорт") тогда
		Объект.Наименование = СокрЛП(Объект.ВидСтандартаНаПродукцию) + ": " + СокрЛП(Объект.Код);
	Иначе
		Объект.Наименование = СокрЛП(Объект.ВидСтандартаНаПродукцию) + " №" + СокрЛП(Объект.Код);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияПоля(Элемент)
	ПриИзмененииЗначенияПоляНаСервере();
КонецПроцедуры