&Вместо("ВремяДокументаПоУмолчанию")
Функция Базар_ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 8, 30);
	
КонецФункции

&Вместо("ТекстЗапросаУстановкаЦен")
Функция Базар_ТекстЗапросаУстановкаЦен(НомераТаблиц)
	
	НомераТаблиц.Вставить("УстановкаЦен", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	УстановкаЦенНоменклатурыТовары.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА УстановкаЦенНоменклатурыТовары.Валюта <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА УстановкаЦенНоменклатурыТовары.Валюта
	|		КОГДА УстановкаЦенНоменклатуры.ТипЦен.ВалютаЦены <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА УстановкаЦенНоменклатуры.ТипЦен.ВалютаЦены
	|		ИНАЧЕ &ВалютаРегламентированногоУчета
	|	КОНЕЦ КАК Валюта
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|		ПО УстановкаЦенНоменклатурыТовары.Ссылка = УстановкаЦенНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО УстановкаЦенНоменклатурыТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И (ЦеныНоменклатуры.Период МЕЖДУ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).Дата, ДЕНЬ))
	|			И (ЦеныНоменклатуры.Регистратор <> &Ссылка)
	|			И (ЦеныНоменклатуры.ТипЦен = ВЫРАЗИТЬ(&Ссылка КАК Документ.УстановкаЦенНоменклатуры).ТипЦен)
	|ГДЕ
	|	НЕ(&НеПроводитьНулевыеЗначения
	|				И УстановкаЦенНоменклатурыТовары.Цена = 0)
	|	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
	|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции // ТекстЗапросаРеквизитыДокумента()