&НаСервереБезКонтекста
Функция ПредопределенноеЗначениеСправочника(ВидСправочника, Код)
	
	Возврат ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", ВидСправочника, Код);
	
КонецФункции

&После("УправлениеФормой")
&НаКлиентеНаСервереБезКонтекста
Процедура Базар_УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.Объект.ВидНоменклатуры = ПредопределенноеЗначениеСправочника("ВидыНоменклатуры", "Товары") тогда
		Элементы.ВесЕдиницы.АвтоОтметкаНезаполненного = Истина;
		Элементы.НоменклатурнаяГруппа.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если Форма.Объект.ВидНоменклатуры = ПредопределенноеЗначениеСправочника("ВидыНоменклатуры", "МногооборотнаяТара") тогда
		Элементы.ГруппаМногооборотнаяТара.Видимость = Истина;
		Элементы.МногооборотнаяТара.АвтоОтметкаНезаполненного = Истина;
		Элементы.МногооборотнаяТараНоменклатура.АвтоОтметкаНезаполненного = Истина;
		Элементы.МногооборотнаяТараКоличествоВМесте.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ГруппаМногооборотнаяТара.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
